INSERT INTO REVIEW_TABLE VALUES (  'Haruka-Tenkai' , 'Y', 0 ,'2016-3-27',  'Posted: 
EARLY ACCESS REVIEW
아직까지는 얼리억세스 게임이라 그런것일까? 전체적으로 컨텐츠가 부족한 느낌을 받았다. DLC를 출시하지 않은 문명같은 느낌이랄까? 전체적으로 심심하고 캐쥬얼한 느낌이었다.

종족별 특성은 함선 디자인이나 종족별 부관의 디자인 그리고 초기 종족 특성 몇가지를 제외하면 전무하다. 원작 마스터 오브 오리온 시리즈를 접해본 적이 없기에 원래 이런 것인지는 모르겠지만, 기존의 SF배경의 4X 게임들에 비해서 종족간의 차이를 확연히 느낄만한 무언가가 없다. 종족을 바꿔해도 스킨만 바꾼 느낌이 든다. 연구 역시도 종족 특화의 연구같은 것이 없고 모든 종족 공통의 연구트리를 가지기 때문에 더더욱 그런 느낌이 강하게 든다.

또 게임을 진행하다보면 GNN뉴스라는 은하계 뉴스가 뜨는데.. 처음에는 조금 신선했지만, 게임을 진행할수록 너무 빈번하게 뜨는 뉴스화면이 게임에 대한 몰입을 떨어뜨리는 것만 같았다.


물론 이런 단점들만 눈에 보인 것은 아니었다. 분명히 마스터 오브 오리온이라는 이 게임만의 장점 역시도 있었다. 먼저 게임내내 자세한 튜토리얼이나 팁이 친절하게 제공된다는 점은 칭찬할만 했다. 이런 친절한 팁과 튜토리얼은 아마 4X게임을 처음 접하는 사람들도 무난하게 적응할 수 있을만한 구성이라고 생각된다.

또한 연출도 제법 마음에 들었다. 새로운 행성에 이주할때마다 뜨는 영화와 같은 연출 영상은 행성마다 다른 연출을 보여주며 멋진 모습을 연출해냈고 전투시에는 리얼타임으로 전투를 진행하며 적용된 기술들을 제법 화려하게 뽐내는 것도 괜찮았다. 또한 행성이나 부관, 지도자등의 3D모델링도 표현하고자 하는 바를 잘 느낄 수 있었기에 충분히 칭찬할만 했다.


이렇게 장점 역시 충분히 있는 마스터 오브 오리온이지만 그래도 역시 전체적인 구성은 아직까지는 실망스럽다. 현재의 마스터 오브 오리온이라는 게임이 약 6만원을 투자할만한 게임인가에 대해서 누군가 나에게 묻는다면, 시간이 지나 언젠가 50%~75%세일을 할때에 한번쯤 사볼만한 게임이야. 라고 대답할 것이다.

물론 아직 오픈된지 얼마 안된 얼리억세스 게임이고 거기에 워게이밍넷의 게임이니까. 현재의 심정은 분명히 비추천이지만, 머지 않은 미래에 추천을 주지 않은 것을 후회할 수도 있을 거라 생각되기에 일단 추천 버튼은 눌러둬야겠다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'TheSalaryHunter' , 'Y', 0 ,'2016-8-7',  'Posted: 
EARLY ACCESS REVIEW
아직 얼리 액세스 단계이지만 큰 포텐셜을 가진 우주 4X 게임입니다.

일단 개발사 공식 한글화가 한국인에게는 큰 메리트이고 그 외에 평타 이상의 그래픽, 깔끔한 UI 등에 좋은 점수를 주고 싶습니다. 그 외에도 외교, 첩보, 은하정부 선거, 우주괴물, 선조 등 여타 이전 4X 게임에 선보였던 기본적인 기능들은 모두 구현되어 있습니다.

자유도는 제한적이며 문명같은 일자형 테크트리, 지정된 항로로만 이동(건설 가능한 워프 스테이션이 나오긴 합니다)하는 시스템입니다. 함대 전투력이 충분하다면 우주기지 건설과 함께 길목을 틀어막아 알박기가 가능합니다. 퀘스트는 없습니다.

개인적으로 우주 4X에 있는 함선 커스텀에 대해 회의적이라 장점이라 말할 수 있을 지 모르겠습니다. 이 게임의 커스텀은, 외양은 2가지로 제한적이지만 각종 무기의 종류와 보조시스템을 채용 여부등을 결정할 수 있습니다. 헤일로, 링월드, 데스스타 같은 것들은 만들 수 없습니다.

이 게임만의 장점이라면 음성 있는 보좌관이나 따로 영상이 있는 은하계 뉴스, 은하계 선거등을 넣어 문명5와 같은 아기자기한 맛이 있다는 것. 초신성 폭발이란 이벤트가 있는 것 같은데 아직 보지는 못했군요. 또한 반절 정도의 테크트리에서는 연구 결과 2~3가지의 기술 중 하나를 고르게 하여 상황에 맞는 기술 커스텀이 자연스럽게 유도됩니다. 이렇게 놓친 기술들은 협의를 통해 타 문명들과 교환이 가능합니다.

단점으로는 아직 외교가 완벽하지 않다는 것(전쟁에서 압도하고 행성 넘겨 받는 게 잘 안되네요..), 첩보원에 레벨이 없어 일정 수준 이상이면 무용지물인 점, 후반기에 턴렉이 살짝 있다는 점, AI 수가 5 개로 제한적인 점 등입니다. 종족의 차이점은 외양과 시작 시 특징일 뿐 테크트리는 같은 점도 살짝 아쉽군요.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'troll attack' , 'Y', 0 ,'2016-5-16',  'Posted: 
EARLY ACCESS REVIEW
약간의 인터페이스 개선이 필요
(다음 유닛 선택 단축키 , 자동저장 ,다음행성 단축키 ,메세지로그 ,생산력을 bc로 전환하거나 오염개선 중 유닛이나 건물을 대기목록에 넣으면 순서가 바뀌게 있으면 좋겠다.)

게임소리를 최대로 했는데 소리가 작다. (게임소리 잘 들릴만하게 올려놨더니 갑자기 온 메세지 소리에 움찔거리는 정도?)

스파이를 어디에 써야할지 모르겠다. 심어놓아도 데이터수집 후 바로 발각당함 확률 좀 알려주랑

버그로 외교창이 흐리게 보이거나 전투시 연속된 폭발음이 들림 (소리깨짐)

적국이 협박으로 병력 동원 해서 공물 요구하는데 승낙하던 안하던 다음턴에 전쟁걸음

함선제작화면에서 함선수치가 잘못 표기, 부품정보가 안뜨거나 오류뜨면서 윈도로 팅김

최적화가 덜 되서인지 턴넘기다가 팅기는 일이 있다.

단축키 옵션 만질때 조심해라 초기화버튼이 없음.



플레이시 소형맵, 4인으로 하길 권장함. 게임이 장기전으로 가면 지루해짐 소형맵해서 난전으로 즐기기를 권장함


-아직 얼리이기 때문에 앞으로 개선될 가능성이 있다. 그걸 보고 산다면 추천

8 월 21일

-오랜만에 다시 해봤는데 겜이 멈추고 하드가 풀로드 되서 강종눌렀는데 강종이 안되는 버그가 있...

-일부 단축키가 먹통임 불편함 (그 중 함선이동 단축키가 T 인데 안되서 일일히 누름 턴넘기기 누르면 자동으로 이동이 되긴하는데 이럴경우 적의 공격이후에 움직여서 튀플이 불가능함)' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'yongS' , 'Y', 0 ,'2016-9-9',  'Posted: 
가격이 싸길래 이범에 처음 4x 장르를 이 게임으로 접했슴.
오늘이 몇일인지 모를정도로 시간가는줄 모르고 하고있슴.
므르샨 여제 가슴.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'solitude the bigboss' , 'Y', 0 ,'2016-8-26',  'Posted: 
문명도 싫어하던 제가 재미있게 플레이 했습니다.
다만 종족간 특성이 음.. 글쎄요... 좀 추가되거나 다양성을 추가해야할듯 싶은데 말입죠...' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  '원하는게뭐양gimchiempire' , 'Y', 0 ,'2017-10-15',  'Posted: 
광고영상의 대규모 함대전은 어디가고 많아야 8~10 기 정도의 전투가 전부. 시작부터 AI가 턴넘기는데 너무 오래걸린다. CPU는 6850K 4.2 이다. 전투가 소규모라고 컨트롤 요소도 없다. 전략 전술 그런거 없이 뭉쳐서 스노우볼 굴리면 하면 된다. 홈월드 같은 진짜 우주 공간에서 하는 전투가 아니라 2D 공간에서 한타 하면 전투가 끝난다' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'LaXenCa-M' , 'Y', 0 ,'2016-3-27',  'Posted: 
EARLY ACCESS REVIEW
추억보정에 의거, ''일단은'' 추천.

+개성있는 캐릭터
+봐줄만한 3D연출
+처음 사용자용 팁

-쓸모없는 overall 화면(구매 버튼 좀 만들어줘~)
-지루한 GNN
-전투(우주,지상)의 지나친 단순화
-모자라는 종족 개성(특히 연구부문)
-사일론=프실론(번역 오류)
-기타 잡다한 버그

결론 : 2016년 3월 28일 현재. 아직 살 때가 아니다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'EVAS' , 'Y', 0 ,'2016-8-29',  'Posted: 
일단 첫인상은 간략화된 스텔라리스,
뭐,, 간략화되었다고 단점만 있는건 아니고. 그만큼 탐험 전투 성장에 집중할수 있게됨

그리고 우주 4x 의 시초를 계승한 이 게임에서 자꾸 문명의 냄새가 난다
모든 외계문명이 비슷한 연구트리를 가지는건 납득하기 어려움
전투유닛 디자인이 함급당 2개씩이라는건 좀 아닌 듯 함

자기가 관리한 행성을 보는 재미는 있음, 뉴스는 좀 지루하고 그놈의 우주장어!

전투는 베가컨플릭트 전투랑 비슷함..아니 똑같나?
결론은 일단 재미는 있으니 스팀 세일때 반값에 사시도록' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'sochieheim' , 'Y', 0 ,'2016-4-2',  'Posted: 
EARLY ACCESS REVIEW
아직 많이 덜 만들어진 상태.
상태를 감안하면 나아질 구석은 많이 보임. 다만 컨텐츠의 양이 1과 2사이에 위치하는 수준일거라고 생각함.
적당히 소프트하게 나와서 라이트 유저들이 하기 좋은 게임이 될 것 같음. 가장 큰 장점은 이런 캐쥬얼성이라고 봄.

꼭 손봐야 하는 단점은 크게 2가지로 보는데, 하나는 후반의 지루지루루즈한 텐션을 어떻게 보완 할 것인가.
또 하나는 문명식의 테크트리가 과연 이 게임에 적절하긴 한 것인가. (물론 이 부분 때문에 캐쥬얼하게 느껴지기도 함)

그래도 비욘드 어스보다는 괜찮은 게임이 되진 않을까 싶은 수준의 가능성은 보여주고 있음...' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'Dracokr' , 'Y', 0 ,'2016-9-26',  'Posted: 
-마스터 오브 오리온 1,2편을 리메이크 한듯 비슷함. 기본 뼈대는 1편에서, UI와 무기등 몇가지 요소는 2에서.
-대부분 비슷하게 들어 있는데 안타란과 리더 시스템, 정치형태는 제외된 듯.
-2편에서 AI대비 가장 큰 운용기술이었던 행성간 대규모 인구 옮기기는 없어지고, 이주선으로 1단위 인구 옮기기만 가능. 그것도 1회용인 민간수송선을 생산해서 옮겨야 한다.
-우주선의 항성간 이동이, 왜곡점을 따라서만 이동 가능해서…뭔가 답답한 느낌을 준다.
-위성은 공전을 하는데, 행성은 공전을 안한다…?
-Elerians(여성형 외계인)와 Gnolams(난쟁이 상인), Trilarians(해파리 외계인) 종족이 사라졌다. 그래서 외계인 구성이 거의 동물농장(곰, 사자, 새, 파충류…)화
-UI와 그래픽 만족. 생산과 연구가 얼마나 걸리는지 더 직관적으로 알수 있고 여러모로 편리해졌다. 다만 전체 은하계 맵이 넓어서 드래그나 줌아웃해서 봐야 하다보니 조금 답답.
-무언가를 결정내릴때 조언자가 세밀하게 설명해주고, 선택 요소들에 작은 아이콘으로 각 분야 조언자들이 추천하는 것을 보여주는 등, 여러모로 초보자 배려가 좋다.
-함선 설계 UI는 훨씬 개선되었지만, 한화면에서 처리되던 전작들에 비해 세부 창들이 열리다보니 조금 복잡해 보인다.
-새로운 함선 파츠가 생기면 기존 파츠에서 버튼 한번만 눌러 업그레이드를 해주는 UI는 무척 편리하지만, 때로는 더 효율이 안좋은 무기로 바뀌기도 한다. 특히 데스레이를 얻으면 플라즈마 무기를 데스레이로 바꾸려고 하기도 하는데, 데미지가 5분의 1로 줄어들기도 한다.
-함선 전투는 3차원으로 보이지만 2차원에서의 전투라서 간단하긴 한데….왠지 아무리 조작해도 자동보다 수동 결과가 안좋다. 요령이 필요한 듯.
-함선 업그레이드를 행성의 생산력으로 못하고 돈으로만 해야 하는 듯, 초반엔 상관없지만 타이탄급 정도 되면 수천수만의 돈이 필요해서 사실상 업그레이드가 힘들다.
-전체 게임 승리 조건이 다양해지고, 승리 그래프에서 시간대를 선택해서 원하는 과거시점으로 게임 로딩이 가능하다는게 대단.
-식량생산이 이전에는 먹여 살리는 요소만 있었는데, 이제는 인구성장에도 관여하다보니 좀더 고려가 필요해졌다. MOO2는 자원이 많은 행성은 생산에만 몰빵하고, 자연환경-만 좋은 행성에서 식량을 만들고 다른 식민지를 먹여 살리는 식으로 최적화가 가능했는데, 이제는 인구성장을 위해 초반에는 식량위주로 생산하고, 그 후에도 계속 식량에 -일정인구를 배치해줘야 한다. 안그러면 인구가 감소한다. 결국 뭐든 빨리 만들어서 확장하는 식의 플레이가 어렵다.
-맵 사이즈를 최대로 하고, 종족숫자도 최대로 해서 플레이하면, 다음 턴 버튼을 누르고 AI가 턴진행하는 시간이 2,3분씩 걸리기도 한다.
-전체적인 식민지 발전이나 확장이 전작들에 비해 오래 걸리고 신경 쓸것이 많으면서, 꼼수를 쓸 여지는 없고….답답한 느낌?
-나선형 은하계를 설정하면 나선과 나선 사이는 불안정한 왜곡점이 생겨서, 해당 기술을 개발하기 전에는 나선을 따라서만 확장이 가능하다는게 신선함.
-게임 최적화가 아직 부족한 듯. XPS13에서도 다소 버벅인다. 특히 인트로 게임동영상이나 메인화면은 제온PC에서도 미세하게 버벅이는데 이게 뭐임? 갤럭시 맵이나 여러장면에서 2D배경+3D오브젝트 식이라 그렇게 사양을 잡아 먹을 것 같지 않은데, 저사양에서 무척 느리다.
-리눅스도 지원한다는데 리눅스에서는 무척 느리거나, 화면이 껌뻑여서 제대로 플레이가 힘들었다.
-AI끼리의 전투가 무척 약하다. 구경하고 있으면 항성계 하나 빼앗는데 100턴 넘게 걸린다. 특히 보호막까지 쳐둔 행성을 공격하는데 상당히 애를 먹는 것 같다. 덕분에 지금까지 AI가 AI를 공격해 멸망시킨거 딱 한번 봤다. 확장 못해서 행성이 두개 밖에 없던 상대였다.
-AI가 함대구성을 좀 지저분하게 한다. 400턴 이후 최후반에 최대 함대를 봐도, 전함 2척에 순양함 4척에 기타 자잘한 녀석들 수십개…이런식이다. 현실이라면 이렇게 혼성 함대가 유리하겠지만, 게임상으로는 큰 전함이 짱이라 이 녀석들 타이탄 함선 2척이면 녹아버린다.

총평

기존 마스터 오브 오리온을 충실히 리메이크 했다는 점이 장점이자 단점이다. 그래픽과 UI는 많은 개선이 이루어졌고, 스파이나 기술선택 등도 개선된 면이 있지만, ‘기존 작보다 새로운 요소는 없다’고 봐도 된다. 기존작품은 90년대 것이니 시스템상 한계가 있어서 어쩔수 없이 종족별로 차이도 크지 않고, 단순한 연구/농사/생산 3가지 관리를 통해 국력을 키우고, 함대를 키워서 밀어붙이기…의 단순 패턴으로 갔지만 21세기 작품도 똑같다는게 문제. 다른 우주게임에서 도입했던 컨텐츠를 절충해서 집어 넣을 수도 있었을텐데 전혀 그런게 없다. 그냥 ‘리메이크’다. 마스터 오브 오리온을 해왔던 사람에게는 학습이 거의 필요없을 정도이다. 오히려 기존 작품에서 리더 시스템이나 안타란등의 랜덤요소가 줄어들어서 게임의 초반 확장세만으로 결과를 예상할 수 있을 지경이다. 반갑고도 아쉽다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'Dybbuk' , 'Y', 0 ,'2016-9-4',  'Posted: 
으레 4X게임이 그렇듯. 종족별로 한두판씩 하고나면 질립니다......

다들 알다시피 꿀성계 먼저먹고, 알박기만 잘하면 이기는 겜...

다로크 아니면 스파이 하기도 힘들고...

함대 이동속도가 좀 느려서 전쟁하려면 미리 전개해놓고 선전포고를 쳐야하네요......

한번 털리면 전선복구가 힘들어요.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'M808B TANK' , 'Y', 0 ,'2017-1-29',  'Posted: 
잼있다' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'rikeion' , 'Y', 0 ,'2017-3-5',  'Posted: 
재밌긴 한데 뭔가 조금씩 부족한 느낌입니다
반값행사때 사서 아깝지는 않네요' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'good night & good luck' , 'Y', 0 ,'2016-11-24',  'Posted: 
JUST DO IT :D' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'Dumass' , 'Y', 0 ,'2016-12-2',  'Posted: 
사실 요즘 4x 게임, 스텔라리스 같은 최신 트렌드의 느낌은 없지만, 어찌되었건 클래식 리메이크 작으로서 옛 향수를 충분히 느끼게 해준다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'NEMOZOA' , 'Y', 0 ,'2017-8-18',  'Posted: 
어...이거 재밌는데 동시에 지루합니다
그냥 200시간 넘게했는데 꿀잼이었는데 지금보니 왜 200시간 넘게 했지? 미스테리다
조금만 더 복합적인 레이아웃을 내걸었으면 400시간은 했을텐데 아쉽
라이트해서 좋긴한데 그 라이트함이 발목을 잡아' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'virus2virus' , 'Y', 0 ,'2016-11-24',  'Posted: 
4X 게임에 대해 관심이 있다면 해볼만 한 게임' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'ellon' , 'Y', 0 ,'2016-8-29',  'Posted: 
평점이 낮아서 걱정했는데 재미있다!! 환불 안하기로 결정!!
앞으로 DLC가 기대되는 게임은 또 처음.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  '[KOR]pssgsd' , 'Y', 0 ,'2016-8-27',  'Posted: 
Product received for free

문명 시리즈 처럼 시간이 금방 지나감!!!!' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'limcokr' , 'Y', 0 ,'2016-9-3',  'Posted: 
마스터 오브 오리온 2를 거의 완벽히 모사했습니다.

장점은 역시나 역사에 남을 명작의 맛이 고대로 묻어나온다는거고

단점은 마스터 오브 오리온 2가 20년도 전에 나온 도스겜이란 거죠.

분명히 2016년에 나온 겜임에도 MOO2보다 추가된 컨텐츠는 없고 누락된 컨텐츠는 있습니다.

사실상 게임성 관련해서는 인터페이스 좋아진 마스터 오브 오리온 2 이상의 평을 주긴 어렵습니다.
AI도 (당연히)도스시절보다야 낫지만 그다지 정교하단 느낌을 주진 않습니다.
MOO2에 비해 가장 진보된건 이런저런 오버밸런스 특성이나 연구를 리밸런싱해놨다는 점인데 아직 고칠점이 있긴하지만 나름 잘되있습니다.

이런저런 불평을 늘어놓았지만 MOO2자체가 전설급 명작이니만큼 처음 해보는 사람들은 재밌게 플레이하실 수 있을 거라고 보장합니다.

하지만 전작을 충분히 물고뜯고 즐긴 골수팬이라면 그다지 색다른 맛을 느끼기는 힘들거라고 생각됩니다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'khator444' , 'Y', 0 ,'2017-5-25',  'Posted: 
hi' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'erevos' , 'Y', 0 ,'2017-1-27',  'Posted: 
꽤나 재밌게 즐길수 있는 게임이 아닐까 생각합니다단점으로는 어느 종족이나 플레이 하다보면 비슷한 플레이만 하게 된다는게 단점이고어느 승리던지 플레이시간이굉장히 길다는것 그리고 일부 승리 난이도가 다르다는게 단점입니다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'adfalcon' , 'N', 0 ,'2016-10-18',  'Posted: 
정통 계승작(개발자 중에도 원전 개발자들이 포함됨) 이고 말 그대로 ''골격''은 이 분들이 만든 거고, 그만큼 단단하면서 골격 자체만으로도 꽤 재미있는 건 사실입니다.

그런데 너무 옛날거 거의 그대로라;;;;(심지어서는 GNN 뉴스까지. 근데 솔직히 GNN뉴스가 꽤 유치함)

지금와서는 endless space 2, stellaris, starbase orion 등등의 원본 + 알파의 물건들이 많아서 추천하기 힘들군요. 같은 핏줄이라도 다음 게임들은 다음의 장점을 더 가지고 있습니다.

* endless space 1, 2 : 1도 더 괜찮고, 2는 얼리억세스 상태이긴 해도 이미 이 ''원본'' 보다 훨 낫다고 봅니다. 더 강한 종족 개성, 내부 정파와 정책, 꽤 깊은 퀘스트 등등 강한 변수가 더 많으며 인터페이스도 더 편함. 정밀한 시나리오와 이벤트 하나하나가 강한 변수로 작동해서 후반까지 그럭저럭 재미있는 편입니다.
* stellaris : 일시정지 되는 리얼타임이라 후반에도 페이스가 유지되고, 캐릭터 개성 및 내부 정치(아직 패치가 덜 되긴 했지만) 가 강한 물건. 패러독스사 게임 답게 굉장히 에픽하게 게임이 변해가는 과정도 멋진 편입니다. 아직 패치가 덜되긴 했지만 그래도 우주 패권 스페이스 오페라 드라마를 즐기려면 이쪽이 더 강렬한 편.
* starbase orion : 이 물건이 제공하는 것 중 이상 현상 몇 가지의 재미있는 이벤트를 제외하면 모바일 버전인 이 물건보다 별로 나을 것이 없습니다. 필요한 건 다 있는데 가볍습니다.

아예 우주 배경 4x 를 안해봤다면 해 보시는 것도 좋을 듯 하지만 지금 시대에 추천하기는 좀 힘듭니다. 뭐 그래도 요즘 시대에 MOO2 를 해보긴 힘들테니 등용문으로 삼거나 원본의 이미지를 알고 싶다면 해볼수도 있을 듯 합니다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  '쌍고등어/친절한지윤씨' , 'N', 0 ,'2017-6-21',  'Posted: 
ㅇ장점 - 함선을 좀 다양하게 꾸밀 수 있다. 무기도 옵션이 다양함
ㅇ단점 - 반복 플레이 요소가 부족하고 플레이가 엄청 단조로움. 콘텐츠 굉장히 부족. 최근 업데이트를 검토하지 않았음....' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'Nyosii' , 'N', 0 ,'2017-6-24',  'Posted: 
고양이가 섹시하다는 점

문명이랑 다른듯 너무 똑같음

세일할때 살걸 그랬다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'NoNamed' , 'N', 0 ,'2017-5-14',  'Posted: 
재미없어...' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'sumemoe' , 'N', 0 ,'2016-11-3',  'Posted: 
가볍게 즐길만은 한 게임입니다.
하지만 이 장르의 비슷한 게임들 중 수작이 너무 많군요.
차라리 그런쪽 게임을 하시길 추천드립니다.
단순히 역설사 게임과 비교해도 MoO은 캐쥬얼 게임으로 느껴질 정도입니다.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'shade_tree' , 'N', 0 ,'2016-5-8',  'Posted: 
EARLY ACCESS REVIEW
It''s not Master of Orion
just casual game!

wargameing Screw you! WTF' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'Nicegom' , 'N', 0 ,'2016-8-27',  'Posted: 
아직 어딘가 완성되지 않은 느낌이 있는 2류게임.

장점 :
- 어렵지 않은 게임성으로 라이트 유저 및 신규 유저들에게 어필하기 좋음
- 튕김없는 안정적인 플레이
- 봐줄만한 그래픽 효과
- 직관적인 UI

단점 :
- 4x 게임이라고 보기에는 너무 라이트함 (디테일한 설정이 불가능)
- 기존 MOO 시리즈의 최대 장점인 함선 Customizing이 이 너무 간소화 됨
- 엉성한 함대전 시네마틱 카메라 시점
- 기술 연구 선택 시 테크트리를 알려면 무조건 테크트리 창을 열어봐야 하는 불편함
- 무성의한 지상전 효과
- 행성이 많아지면 관리하기가 귀찮아짐. 특히, 오염관리.' ,298050);
INSERT INTO REVIEW_TABLE VALUES (  'AKissToBuildADreamOn' , 'N', 0 ,'2016-5-23',  'Posted: 
"태초에 마스터 오브 오리온 1과 2가 있었다."라고 해도 뭐 다들 어느 정도 수긍해주는 시리즈의 게임입니다.
3이요?
3이라...
3인가요?
3을 말하셔야했나요? 그냥 말 안하면 대충 넘어가주는 정도의 아량을 발휘해주실 수는 없나요.
진정 마스터 오브 오리온 3이라는 말을 해보고 싶으신 건가요?
그러니까 moo3이라 이거죠?
흐음... 혹시 매저키스트한 성향을 가지고 계신가요?

여튼 뭐 그런 시리즈의 최신작입니다. 그 3을 마지막으로 개발사와 제작사와 배포사가 말끔히 망해버려서 라이센스를 다른 회사에서 구입해서 깔끔하게 나왔군요.
그런데 말입니다. 그 덕에 말입니다. 그 회사가 워게이밍 랩인 바람에 말입니다.
한글화가 정식으로 제공됩니다. 얼액인데도 말이죠. ㅜㅜ
뭐 물론 이곳 저곳에서 좀 어색한 번역이 보이기는 합니다만...
꾸준한 피드백을 해주시는, 제가 아닌, 다른 게이머들에 의해 좀더 깔끔한 번역이 될 것이라 믿고 저는 게임만...

흐음... 그런데 말입니다.
AI가 바보든가 아님 평화주의자인지라... ㅜㅜ 어지간히 플레이어가 우위를 점하지 않는 이상은
싸움 걸 생각을 않는군요. 해적이나 우주 괴수가 아니었더라면 심심해서 죽어버릴 뻔...
분명히 종족마다 뭔가 차이는 있는데 그 차이를 두드러지게 느낄 수가 없습니다. ㅜㅜ

아, 물론 moo3보다는 재밌습니다. 하지만 MOO2만큼 재밌다고 말하기는 아직 어렵네요.
솔직히 도미니언 시리즈가 나오기 전까지 턴방식의 끝판왕으로는 MOO2을 꼽아도 어디 꿀리지는 않는 분위기였는데...
MOO는 아직은 그 영광(?)을 되찾기에는 이른 듯한 느낌입니다.
턴방식에는 도미니언4가 있고, 우주4x게임 끝판왕으로는 머나먼 세계가 있으니... MOO가 가야할 길은 먼 듯 합니다.

지금 느낌을 말하란다면 Rising Tide 나오기 전의 Beyond Earth같은 느낌이군요.

이런 분들에게 추천합니다. MOO 1이나 2를 재밌게 했다. moo3은 쓰레기다라고 생각하시는 MOO가 무엇의 약자인지 아시는 분들.
이런 분들은 조금 기다려 주세요. 턴방식 4x게임의 AI는 못해도 문명 4 정도는 되어야한다라고 생각하시는 분들.

이 평가는 얼액 단계에서 작성된 것이며 추후 게임이 완성된 뒤에 감상이 바뀔 수 있습니다.
=========
라고 썼는데 변한 것 없이 출시되었고, 컬렉터스 에디션 사용자에게는, 추가 dlc의 할인이라든가 등의,추가적이 혜택이 없습니다.
지금 와서 굳이 라간지를 위해 MOO의 구버전을 찾으시는 게 아니시라면 굳이 컬렉터스 에디션 사실 필요 없다고 봅니다.

제 평가는 변함이 없군요.
정말 빠방하게 지원받은 게임이지만
AI가 빠가사리급의 지능이라... 재미가 없습니다.
차라리
스텔라리스
디스탄트 유니버스
엔들리스 스페이스 2
갤럭틱 시빌리제이션 3
판도라
등을 하세요.

턴방식 4x전략의 끝판왕에는 여전히 도미니언 4가 있고
4x 우주 게임의 끝판왕에는 여전히 디스탄트 유니버스가 있습니다.

유감이네요.

아, 물론 얼액 평가 때에도 말한 거지만 MOO3보다는 재밌습니다.
MOO2의 재미에 비하면 심심해요.' ,298050);
